//模拟新闻数据
const news = [
  {id: '264698',
  title: '中共中国海洋大学第十一届委员会第四次全体会议召开',
  poster: 'https://news.ouc.edu.cn/_upload/article/images/12/8b/de7f4963476da934b54aebfb8f97/36529309-d65e-48cb-ba3f-016cac9f4d19.jpg',
  content: `
  本站讯 8月30日，中共中国海洋大学第十一届委员会第四次全体会议在崂山校区召开。会议由中国海洋大学党委常委会主持。学校党委委员出席会议，纪委委员列席会议。

会议深入学习贯彻党的二十届三中全会精神，听取并审议通过了田辉代表党委常委会所作的《中共中国海洋大学第十一届委员会第四次全体会议工作报告》（以下简称《报告》）。

会议认为，党的二十届三中全会是在以中国式现代化全面推进强国建设、民族复兴伟业的关键时期召开的一次十分重要的会议。《中共中央关于进一步全面深化改革、推进中国式现代化的决定》，紧紧围绕推进中国式现代化这个主题，擘画了进一步全面深化改革战略举措，是指导新征程上进一步全面深化改革的纲领性文件，必将对党和国家事业发展产生重大而深远的影响。全校要把学习贯彻党的二十届三中全会精神作为重大政治任务，以实际行动坚定拥护“两个确立”、坚决做到“两个维护”。

会议认为，《报告》坚持以习近平新时代中国特色社会主义思想为指导，全面贯彻党的二十大和二十届二中、三中全会精神，深入总结了2024年以来学校改革发展的主要成绩，深刻分析了学校工作面临的问题和不足，科学部署了下一阶段工作，主题鲜明、立意高远、思路清晰、求真务实，充分体现了学校党委总揽全局、抢抓机遇、开拓奋进的政治担当和战略思维，对团结带领全校师生推动学校事业高质量发展，加快建设特色显著的世界一流大学具有重要意义。

会议充分肯定了党委常委会2024年以来的工作。一致认为，今年以来，党委常委会深入学习贯彻习近平总书记关于教育的重要论述和视察山东重要讲话精神，认真贯彻落实党中央部署和教育部党组要求，以实际行动坚定拥护“两个确立”、坚决做到“两个维护”，高质量开展党纪学习教育，牢牢把握建校100周年重大历史机遇，全面落实学校第十一次党代会战略部署，着力提升作风能力，奋力推进实施新时代海大工程、打造新时代海大范式，学校各项工作取得新成绩，事业发展呈现新气象。

会议强调，新学期学校将坚持以习近平新时代中国特色社会主义思想为指导，深入贯彻落实习近平总书记关于教育和建设海洋强国的重要论述、视察山东重要讲话精神、对青岛工作重要指示要求，全面学习贯彻党的二十届三中全会精神和即将召开的全国教育大会精神，全面加强党的领导和建设，深入落实教育强国建设规划纲要，精心组织庆祝建校100周年系列活动，勇担使命、踔厉奋发，锐意进取、开拓创新，加快推动落实学校第十一次党代会战略安排，深入实施新一轮“双一流”建设方案和学校“十四五”事业发展规划，确保高质量完成好今年的各项任务。

会议号召，全校各级党组织、全体党员干部和广大师生员工要要统一思想、锚定目标、加压奋进、狠抓落实，以前所未有的责任担当精神、前所未有的干事创业精神、前所未有的改革创新精神、前所未有的勇于斗争精神、前所未有的自我革命精神，奋力推动学校一流大学建设开创新局面，以优异成绩迎接中华人民共和国成立75周年和学校建校100周年。

会上，李岩、荆莹、王卫栋、任玮娜、王曙光、董军宇等同志结合《报告》内容先后作重点交流发言。

通讯员：陈兴旺 图：赵奚赟
  `,
  add_date: '2024-08-31'},
  {id: '304083',
  title: '田辉检查指导 2024 级学生军训工作',
  poster: 'https://news.ouc.edu.cn/_upload/article/images/59/30/d19095614e568f55a5f692311218/bad85368-4b34-4c47-a9e4-737e543d3bf5.jpg',
  content: `本站讯 8月30日，学校党委书记田辉到崂山校区运动场检查指导 2024 级本科学生军训工作，慰问参训学生、教官和指导员。党委常委、副校长王雪鹏陪同检查。

  田辉听取了学生军训团关于军训的组织开展情况，走访学生训练方队，关心询问学生训练感受，并与参训人员亲切交流。田辉对同学们积极投入的训练态度和朝气蓬勃的精神面貌给予充分肯定，对承担军训任务的教官、指导员的辛勤工作表示感谢，对学生军训志愿者表示慰问。他勉励参训学生敢于吃苦、锻炼体魄、磨练意志，为大学生活打下扎实基础，同时要注意训练安全；希望军训团结合实际，科学组训，同时要统筹协调相关部门，切实做好学生军训的服务保障工作，确保军训工作安全顺利。
  
  学校党委办公室、校长办公室、学生工作处、武装部相关负责同志，学部、各学院（中心）军训负责人陪同检查。
  
  通讯员：常聪 图：赵奚赟`,
  add_date: '2024-08-31'},
  {id: '305670',
  title: '中交疏浚（集团）股份有限公司党委书记、董事长刘永满一行到中国海洋大学调研',
  poster: 'https://news.ouc.edu.cn/_upload/article/images/73/48/f5ef2ba040c384d2a2b76c840ba2/27a4e591-9e1b-49e9-90c7-b8326690e2fd.jpg',
  content: `本站讯 8月28日，中交疏浚（集团）股份有限公司（以下简称“中交疏浚集团”）党委书记、董事长刘永满一行到中国海洋大学调研。校长张峻峰、副校长王厚杰出席座谈会。
  　　
  张峻峰对刘永满一行来校调研表示欢迎。他介绍了学校近年来在学科建设、人才培养、校企合作等方面取得的成绩，以及学校在海洋牧场、海工装备、海洋生态修复等领域开展的相关工作。他表示，中交疏浚集团是全球领先的特大型基础设施综合服务商，希望双方发挥各自优势，围绕海洋牧场、海洋生态修复、固废处理、深远海工程和技术资源等产业方向，在人才培养、科技合作、成果转化等方面深入对接，推动双方全面合作框架协议落地落实落细，共同为海洋强国建设贡献力量。

     刘永满祝贺中国海洋大学即将迎来百年华诞，同时对海大长期以来给予中交疏浚集团的支持表示感谢。他简要介绍了中交疏浚集团的基本情况。他表示，中交疏浚集团正处在转型升级的关键阶段，将重点开展海洋环境、海洋工程等海洋业务，希望双方进一步整合优势资源，升级合作关系，共同建设好中央企业海洋工程技术创新联合体，持续推动“四链”深度融合，加快培育海洋领域新质生产力，助力我国海洋经济高质量发展。
  　　会上，双方围绕深化落实全面合作框架协议、共建中央企业海洋工程技术创新联合体等进行了深入交流。
  　　中交疏浚集团副总裁、副总工程师张晴波，中交疏浚集团办公室、市场开发部，中交海洋建设开发有限公司，中交疏浚长三角分公司，学校国内合作工作办公室、研究生院、水产学院、工程学院等相关单位负责同志、专家参加座谈。
  通讯员：平晓涛　图：周文燕`,
  add_date: '2024-08-30'}
];

//获取新闻列表
function getNewsList() {
  let list = [];
  for (var i = 0; i < news.length; i++) {
    let obj = {};
    obj.id = news[i].id;
    obj.poster = news[i].poster;
    obj.add_date = news[i].add_date;
    obj.title = news[i].title;
    list.push(obj);
  }
  return list; //返回新闻列表
}

//获取新闻内容
function getNewsDetail(newsID) {
  let msg = {
    code: '404', //没有对应的新闻
    news: {}
  };
  for (var i = 0; i < news.length; i++) {
    if (newsID == news[i].id) { //匹配新闻id编号
      msg.code = '200'; //成功
      msg.news = news[i]; //更新当前新闻内容
      break;
    }
  }
  return msg; //返回查找结果
}

// 对外暴露接口
module.exports = {
  getNewsList: getNewsList,
  getNewsDetail: getNewsDetail
}